terraform plan:
```
aws_vpc.dev_vpc: Refreshing state... [id=vpc-0e434fc937ec7c46c]
aws_spot_instance_request.dev[0]: Refreshing state... [id=sir-9nfy854k]
aws_internet_gateway.gw: Refreshing state... [id=igw-0d13bdb32f42b8240]
aws_subnet.dev_us_east_1a: Refreshing state... [id=subnet-031948f8e811d6a18]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_instance.dev[0] will be created
  + resource "aws_instance" "dev" {
      + ami                                  = "ami-031283ff8a43b021c"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.large"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "Kaveh"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-031948f8e811d6a18"
      + tags                                 = {
          + "Name" = "dev"
        }
      + tags_all                             = {
          + "Name" = "dev"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "b9431714e23cf74e964c761947ebab77c947b9d9"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-007ae9d2199ea1f25",
          + "sg-09bafcc41daecda49",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_spot_instance_request.dev[0] will be destroyed
  - resource "aws_spot_instance_request" "dev" {
      - ami                             = "ami-031283ff8a43b021c" -> null
      - associate_public_ip_address     = true -> null
      - block_duration_minutes          = 0 -> null
      - get_password_data               = false -> null
      - id                              = "sir-9nfy854k" -> null
      - instance_interruption_behavior  = "terminate" -> null
      - instance_interruption_behaviour = "terminate" -> null
      - instance_type                   = "t3.large" -> null
      - ipv6_address_count              = 0 -> null
      - ipv6_addresses                  = [] -> null
      - key_name                        = "Kaveh" -> null
      - primary_network_interface_id    = "eni-0c527bcd10a3d4ad3" -> null
      - private_dns                     = "ip-172-16-10-246.ec2.internal" -> null
      - private_ip                      = "172.16.10.246" -> null
      - public_dns                      = "ec2-54-159-226-223.compute-1.amazonaws.com" -> null
      - public_ip                       = "54.159.226.223" -> null
      - secondary_private_ips           = [] -> null
      - security_groups                 = [] -> null
      - source_dest_check               = true -> null
      - spot_bid_status                 = "fulfilled" -> null
      - spot_instance_id                = "i-047bbb6e4fd955f10" -> null
      - spot_price                      = "0.083200" -> null
      - spot_request_state              = "active" -> null
      - spot_type                       = "persistent" -> null
      - subnet_id                       = "subnet-031948f8e811d6a18" -> null
      - tags                            = {
          - "Name" = "dev"
        } -> null
      - tags_all                        = {
          - "Name" = "dev"
        } -> null
      - user_data                       = "b9431714e23cf74e964c761947ebab77c947b9d9" -> null
      - valid_from                      = "0001-01-01T00:00:00Z" -> null
      - valid_until                     = "0001-01-01T00:00:00Z" -> null
      - vpc_security_group_ids          = [
          - "sg-007ae9d2199ea1f25",
          - "sg-09bafcc41daecda49",
        ] -> null
      - wait_for_fulfillment            = true -> null

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-06a0cd2215b379e88" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # cloudflare_record.dev[0] will be created
  + resource "cloudflare_record" "dev" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "dev0"
      + proxiable       = (known after apply)
      + ttl             = 120
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ dev_ip = [
      - "54.159.226.223",
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```